## Задачи по Python ##

***

Возможные дальнейшие улучшения по проекту:

+ Использовать более правильно конструкции языка Python
+ Следовать стилю кода PEP 8 

***

### Задание № 1 ###

#### Задача № 1 ####

Напишите программу, которая запрашивает у пользователя два целых числовых значения a, b – катеты прямоугольного
треугольника, и вычисляет значение гипотенузы. Вывести на экран вычисленное значение

#### Решение ####

```python
a, b = map(int, input('Введите катеты прямоугольного треугольника: ').split())
c = (a**2 + b**2)**0.5
print(c)
```

***

#### Задача № 2

Напишите программу, которая запрашивает у пользователя вещественное значение a и проверяет вхождение этого числа в
диапазон[-5; 10]. Вывести на экран полученное булево значение(True или False)

#### Решение ####

```python
a = float(input('Введите значение: '))
if -5 <= a <= 10:
    print(True)
else:
    print(False)
```

***

### Задание № 2 ###

#### Задача № 1 ####

Вводится строка с одним арифметическим действием (сложением) для двух целых чисел. Например, «5+3» или «7 + 2». Обратите внимание на возможные пробелы до и после оператора +. Вычислить, указанное в строке арифметическое действие и результат вывести на экран

#### Решение ####

```python
expression = input('Введите выражение: ').split('+')

result = 0

for token in expression:
    if token != '+':
        result += int(token)

print(result)
```

***

#### Задача № 2

Вводится список вещественных чисел в одну строчку через пробел. Необходимо представить его в виде списка вещественных чисел, а затем, найти минимальное среди этих чисел и вывести его на экран

#### Решение ####

```python
floats = map(float, input('Введите список: ').split())
print(min(floats))

```

***

### Задание № 3 ###

#### Задача № 1 ####

Вводятся коэффициенты a, b, c квадратного уравнения вида: ax2 +bx+ c = 0. Необходимо определить, имеет ли уравнение хотя бы один корень. Вывести «ДА», если решения есть и «НЕТ» - в противном случае

#### Решение ####

```python
a, b, c = map(float, input('Введите коэффициенты: ').split())

discriminant = b**2 - 4*a*c

if discriminant < 0:
    print('НЕТ')
else:
    print('ДА')
```

***

#### Задача № 2

Вводятся два целых значения m, n. Необходимо вывести их частное (m/n), если m нацело делится на n (и n не равно нулю). Иначе вывести их произведение. Реализовать программу с использованием тернарного условного оператора

#### Решение ####

```python
m, n = map(int, input('Введите два целых значения: ').split())
print(m // n if m % n == 0 and n != 0 else m * n)
```

***

### Задание № 4 ###

#### Задача № 1 ####

Вводится натуральное число. Необходимо вычислить сумму цифр этого числа. Результат вывести на экран. Программу реализовать с использованием цикла while

#### Решение ####

```python
number = int(input('Введите натуральное число: '))

result = 0

while number > 0:
    digit = number % 10
    result += digit
    number //= 10

print(result)
```

***

#### Задача № 2

Вводится список городов в одну строчку через пробел. Преобразовать эту строку в список слов и, затем, через итератор выбрать первые два значения этого списка и вывести их на экран

#### Решение ####

```python
cities = input('Введите список городов: ').split()

for city in cities[:2]:
    print(city, end=' ')
```

***

### Задание № 5 ###

#### Задача № 1 ####

Вводится семизначное целое положительное число. С помощью list comprehension сформировать список, содержащий цифры этого числа (в списке должны быть записаны числа, а не строки). Результат вывести на экран в одну строку через пробел

#### Решение ####

```python
number = list(input('Введите семизначное целое положительное число: '))
result = [int(digit) for digit in number]
print(' '.join(digit for digit in number))
```

***

#### Задача № 2

Вводится список целых чисел в строку через пробел. Количество чисел равно N**2. С помощью list comprehension сформировать из них двумерный (вложенный) список размером N x N (квадратную таблицу чисел). Гарантируется, что из набора введенных чисел можно сформировать квадратную матрицу (таблицу). Результат отобразить на экране

#### Решение ####

```python
numbers = list(map(int, input('Введите список целых чисел: ').split()))
N = int(len(numbers) ** 0.5)
matrix = [[numbers[row * N + column] for column in range(N)] for row in range(N)]
print(matrix)
```

***

#### Примечание к решению для матрицы 3х3 ####

```python
'''
numbers[row * N + column]
numbers[0 * 3 + 0]
numbers[0 * 3 + 1]
numbers[0 * 3 + 2]
numbers[1 * 3 + 0]
numbers[1 * 3 + 1]
numbers[1 * 3 + 2]
numbers[2 * 3 + 0]
numbers[2 * 3 + 1]
numbers[2 * 3 + 2]
'''
```

***

### Задание № 6 ###

#### Задача № 1 ####

Вводится строка с русскими и латинскими буквами. Например: «Занятие по языку Python». Необходимо с помощью словаря t (приведен в приложении после этой таблицы) перевести введенную строку в латиницу. Кроме того, символы " ?!;:" заменять на символ дефиса (-). Замены делать без учета регистра (строку перевести в нижний регистр – малые буквы). Результат вывести на экран

#### Решение ####

```python
text = input('Введите строку: ').lower()
result = ''

t = {'ё': 'yo', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'zh',
     'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
     'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch', 'ш': 'sh',
     'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya', ' ': '-', '?': '-', '!': '-', ';': '-',
     ':': '-'
     }

for symbol in text:
    if symbol in t.keys():
        result += str(t.get(symbol))
    else:
        result += symbol

print(result)
```

***

#### Задача № 2

Вводятся имена студентов в одну строчку через пробел. На их основе формируется кортеж. Отобразите на экране все имена из этого кортежа, которые содержат фрагмент "ва". Имена выводятся в одну строку через пробел

#### Решение ####

```python
students = tuple(input('Введите имена студентов: ').split())
mark = 'ва'

for student in students:
    if mark in student:
        print(student, end=' ')
```
